{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dtype": "float32", "strides": [1, 1], "activation": "relu", "name": "Conv-1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_size": [5, 5], "activity_regularizer": null, "batch_input_shape": [null, 50, 534, 1], "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "Pool-1", "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"bias_regularizer": null, "kernel_regularizer": null, "padding": "valid", "dilation_rate": [1, 1], "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "strides": [1, 1], "activation": "relu", "name": "Conv-2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "kernel_size": [5, 5], "activity_regularizer": null, "trainable": true, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "Pool-2", "padding": "valid", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "Flat", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"rate": 0.2, "seed": null, "name": "dropout_1", "trainable": true, "noise_shape": null}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "name": "Dense-1", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "beta_constraint": null, "beta_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "center": true, "gamma_constraint": null, "epsilon": 0.001, "trainable": true, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "name": "Dense-2", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "relu", "name": "Dense-3", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}}, {"class_name": "Dense", "config": {"bias_regularizer": null, "kernel_regularizer": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "activation": "linear", "name": "Out", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true}}], "backend": "tensorflow", "keras_version": "2.2.2"}