{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "dtype": "float32", "bias_regularizer": null, "strides": [1, 1], "filters": 8, "kernel_size": [5, 5], "activity_regularizer": null, "use_bias": true, "batch_input_shape": [null, 50, 1053, 1], "name": "Conv-1", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "padding": "valid", "pool_size": [2, 2], "name": "Pool-1", "data_format": "channels_last", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"trainable": true, "dilation_rate": [1, 1], "padding": "valid", "bias_constraint": null, "kernel_constraint": null, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "filters": 16, "strides": [1, 1], "kernel_size": [5, 5], "activity_regularizer": null, "use_bias": true, "name": "Conv-2", "data_format": "channels_last", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flat", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"trainable": true, "units": 64, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "Dense-1", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "gamma_regularizer": null, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "center": true, "epsilon": 0.001, "axis": -1, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "units": 16, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "Dense-2", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"trainable": true, "units": 8, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "Dense-3", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}, {"class_name": "Dense", "config": {"trainable": true, "units": 4, "bias_constraint": null, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "use_bias": true, "name": "Out", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}}}], "keras_version": "2.2.2", "backend": "tensorflow"}