{"class_name": "Sequential", "keras_version": "2.2.2", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"name": "Conv-1", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 8, "padding": "valid", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "bias_regularizer": null, "batch_input_shape": [null, 50, 534, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}, "dtype": "float32"}}, {"class_name": "MaxPooling2D", "config": {"name": "Pool-1", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"name": "Conv-2", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "filters": 16, "padding": "valid", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "use_bias": true, "dilation_rate": [1, 1], "data_format": "channels_last", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "MaxPooling2D", "config": {"name": "Pool-2", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "valid", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"name": "Flat", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "seed": null, "noise_shape": null, "rate": 0.2}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "use_bias": true, "name": "Dense-1", "bias_regularizer": null, "units": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "BatchNormalization", "config": {"center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "beta_regularizer": null, "trainable": true, "axis": -1, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "name": "batch_normalization_1", "gamma_constraint": null, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99}}, {"class_name": "Activation", "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "use_bias": true, "name": "Dense-2", "bias_regularizer": null, "units": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "relu", "trainable": true, "use_bias": true, "name": "Dense-3", "bias_regularizer": null, "units": 8, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "trainable": true, "use_bias": true, "name": "Out", "bias_regularizer": null, "units": 4, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}}}}]}