{"config": [{"config": {"strides": [1, 1], "batch_input_shape": [null, 50, 1053, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "PreConv-1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "padding": "valid", "dtype": "float32", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 16}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "batch_input_shape": [null, 50, 1053, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "PreConv-2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "padding": "valid", "dtype": "float32", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "PrePool-2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "batch_input_shape": [null, 50, 1053, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Conv-1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "padding": "valid", "dtype": "float32", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 32}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Conv-2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "padding": "valid", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "pool_size": [2, 2], "data_format": "channels_last", "name": "Pool-2", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"strides": [1, 1], "dilation_rate": [1, 1], "bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Conv-3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_size": [6, 6], "padding": "valid", "trainable": true, "kernel_constraint": null, "activity_regularizer": null, "data_format": "channels_last", "use_bias": true, "kernel_regularizer": null, "filters": 64}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "Flat"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "noise_shape": null, "rate": 0.2}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Dense-1", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 256, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"gamma_constraint": null, "scale": true, "center": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "gamma_regularizer": null, "trainable": true, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Dense-2", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 256, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Dense-3", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 128, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Dense-4", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 64, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Dense-5", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 32, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Dense-6", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 16, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "relu", "bias_regularizer": null, "name": "Dense-7", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 8, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "activation": "linear", "bias_regularizer": null, "name": "Out", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "units": 4, "use_bias": true, "kernel_regularizer": null}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential", "backend": "tensorflow"}