{"config": [{"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 16, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "PreConv-1", "batch_input_shape": [null, 50, 1053, 1], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "PreConv-2", "batch_input_shape": [null, 50, 1053, 1], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "name": "PrePool-2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "trainable": true, "filters": 32, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activation": "relu", "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "Conv-1", "batch_input_shape": [null, 50, 1053, 1], "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null}, "class_name": "Conv2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "filters": 64, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "Conv-2", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "padding": "valid", "name": "Pool-2", "data_format": "channels_last", "pool_size": [2, 2], "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "filters": 64, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "data_format": "channels_last", "kernel_size": [6, 6], "use_bias": true, "bias_constraint": null, "padding": "valid", "name": "Conv-3", "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "strides": [1, 1]}, "class_name": "Conv2D"}, {"config": {"data_format": "channels_last", "trainable": true, "name": "Flat"}, "class_name": "Flatten"}, {"config": {"trainable": true, "seed": null, "name": "dropout_1", "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 256, "kernel_constraint": null, "name": "Dense-1"}, "class_name": "Dense"}, {"config": {"scale": true, "trainable": true, "beta_regularizer": null, "gamma_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "beta_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "momentum": 0.99, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "epsilon": 0.001}, "class_name": "BatchNormalization"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 256, "kernel_constraint": null, "name": "Dense-2"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 128, "kernel_constraint": null, "name": "Dense-3"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 64, "kernel_constraint": null, "name": "Dense-4"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 32, "kernel_constraint": null, "name": "Dense-5"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 16, "kernel_constraint": null, "name": "Dense-6"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 8, "kernel_constraint": null, "name": "Dense-7"}, "class_name": "Dense"}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "linear", "trainable": true, "kernel_regularizer": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "use_bias": true, "bias_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "units": 4, "kernel_constraint": null, "name": "Out"}, "class_name": "Dense"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.2.2"}