{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_size": [5, 5], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 50, 534, 1], "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "PreConv-1", "bias_regularizer": null, "trainable": true, "filters": 16, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_size": [5, 5], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 50, 534, 1], "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "PreConv-2", "bias_regularizer": null, "trainable": true, "filters": 32, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "PrePool-2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"dtype": "float32", "kernel_size": [5, 5], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "batch_input_shape": [null, 50, 534, 1], "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "Conv-1", "bias_regularizer": null, "trainable": true, "filters": 32, "kernel_constraint": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "Conv-2", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "Pool-2", "data_format": "channels_last", "trainable": true, "strides": [2, 2], "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Conv2D", "config": {"kernel_size": [6, 6], "data_format": "channels_last", "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "filters": 64, "padding": "valid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "kernel_regularizer": null, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "name": "Conv-3", "bias_regularizer": null, "bias_constraint": null, "kernel_constraint": null}}, {"class_name": "Flatten", "config": {"name": "Flat", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dropout", "config": {"rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null, "trainable": true}}, {"class_name": "Dense", "config": {"units": 256, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Dense-1", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "BatchNormalization", "config": {"momentum": 0.99, "gamma_constraint": null, "beta_regularizer": null, "beta_constraint": null, "epsilon": 0.001, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "name": "batch_normalization_1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "scale": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"units": 256, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Dense-2", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 128, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Dense-3", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 64, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Dense-4", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 32, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Dense-5", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 16, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Dense-6", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 8, "activation": "relu", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Dense-7", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "Dense", "config": {"units": 4, "activation": "linear", "activity_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "name": "Out", "bias_regularizer": null, "kernel_regularizer": null, "kernel_constraint": null}}], "keras_version": "2.2.2"}