{"backend": "tensorflow", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"padding": "valid", "strides": [1, 1], "name": "Conv-1", "batch_input_shape": [null, 50, 534, 1], "trainable": true, "filters": 8, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "dtype": "float32", "kernel_size": [5, 5], "bias_regularizer": null, "kernel_regularizer": null, "use_bias": true, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "Pool-1", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"padding": "valid", "strides": [1, 1], "name": "Conv-2", "trainable": true, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "kernel_size": [5, 5], "use_bias": true, "bias_regularizer": null, "kernel_regularizer": null, "filters": 16, "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "strides": [2, 2], "name": "Pool-2", "trainable": true, "data_format": "channels_last", "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flat", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "name": "dropout_1", "seed": null}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "Dense-1", "trainable": true, "activity_regularizer": null, "units": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "BatchNormalization", "config": {"epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "name": "batch_normalization_1", "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "Dense-2", "trainable": true, "activity_regularizer": null, "units": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "Dense-3", "trainable": true, "activity_regularizer": null, "units": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "relu"}}, {"class_name": "Dense", "config": {"use_bias": true, "name": "Out", "trainable": true, "activity_regularizer": null, "units": 4, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "kernel_regularizer": null, "activation": "linear"}}], "keras_version": "2.2.2"}