{"backend": "tensorflow", "config": [{"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 50, 534, 1], "use_bias": true, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "filters": 16, "activation": "relu", "kernel_regularizer": null, "name": "PreConv-1", "trainable": true, "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 50, 534, 1], "use_bias": true, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "filters": 16, "activation": "relu", "kernel_regularizer": null, "name": "PreConv-2", "trainable": true, "data_format": "channels_last", "kernel_size": [3, 3]}, "class_name": "Conv2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "batch_input_shape": [null, 50, 534, 1], "use_bias": true, "bias_regularizer": null, "dtype": "float32", "bias_constraint": null, "dilation_rate": [1, 1], "filters": 16, "activation": "relu", "kernel_regularizer": null, "name": "Conv-1", "trainable": true, "data_format": "channels_last", "kernel_size": [10, 10]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "Pool-1"}, "class_name": "MaxPooling2D"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "dilation_rate": [1, 1], "filters": 32, "activation": "relu", "kernel_regularizer": null, "name": "Conv-2", "trainable": true, "data_format": "channels_last", "kernel_size": [10, 10]}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "strides": [2, 2], "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "name": "Pool-2"}, "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "Flat"}, "class_name": "Flatten"}, {"config": {"noise_shape": null, "name": "dropout_1", "trainable": true, "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "units": 64, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "trainable": true, "name": "Dense-1"}, "class_name": "Dense"}, {"config": {"center": true, "beta_constraint": null, "scale": true, "epsilon": 0.001, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "momentum": 0.99, "gamma_regularizer": null, "trainable": true, "axis": -1, "beta_regularizer": null, "name": "batch_normalization_1"}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "units": 32, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "trainable": true, "name": "Dense-2"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "units": 16, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "kernel_regularizer": null, "trainable": true, "name": "Dense-3"}, "class_name": "Dense"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_constraint": null, "units": 4, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activation": "linear", "kernel_regularizer": null, "trainable": true, "name": "Out"}, "class_name": "Dense"}], "keras_version": "2.2.2", "class_name": "Sequential"}