{"keras_version": "2.2.2", "config": [{"config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "PreConv-1", "batch_input_shape": [null, 50, 534, 1], "dilation_rate": [1, 1], "padding": "valid", "filters": 16, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "kernel_constraint": null, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "PreConv-2", "batch_input_shape": [null, 50, 534, 1], "dilation_rate": [1, 1], "padding": "valid", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "kernel_constraint": null, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "PrePool-2", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "Conv-1", "batch_input_shape": [null, 50, 534, 1], "dilation_rate": [1, 1], "padding": "valid", "filters": 32, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "kernel_constraint": null, "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "Conv-2", "dilation_rate": [1, 1], "padding": "valid", "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [5, 5], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "Pool-2", "padding": "valid", "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "strides": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "Conv-3", "dilation_rate": [1, 1], "padding": "valid", "filters": 64, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "kernel_size": [6, 6], "kernel_constraint": null}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "Flat", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.2, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "Dense-1", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"beta_constraint": null, "epsilon": 0.001, "gamma_regularizer": null, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "axis": -1, "scale": true, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "trainable": true, "center": true, "gamma_constraint": null, "beta_regularizer": null, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_1", "momentum": 0.99}, "class_name": "BatchNormalization"}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "class_name": "Activation"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "Dense-2", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 256, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "Dense-3", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "relu", "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "bias_regularizer": null, "trainable": true, "activity_regularizer": null, "name": "Out", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "activation": "linear", "units": 4, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null}, "class_name": "Dense"}], "class_name": "Sequential", "backend": "tensorflow"}