{"class_name": "Sequential", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "filters": 8, "padding": "valid", "kernel_size": [5, 5], "strides": [1, 1], "kernel_constraint": null, "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 50, 1053, 1], "activity_regularizer": null, "data_format": "channels_last", "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "Conv-1", "use_bias": true, "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "name": "Pool-1", "strides": [2, 2]}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "trainable": true, "bias_constraint": null, "filters": 16, "padding": "valid", "kernel_size": [5, 5], "activation": "relu", "kernel_constraint": null, "dilation_rate": [1, 1], "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "Conv-2", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "Flat", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "seed": null, "rate": 0.2, "noise_shape": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "units": 64, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "Dense-1", "use_bias": true, "bias_regularizer": null}}, {"class_name": "BatchNormalization", "config": {"moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_1", "gamma_constraint": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "gamma_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "axis": -1, "beta_regularizer": null, "scale": true, "momentum": 0.99, "beta_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "units": 16, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "Dense-2", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "units": 8, "bias_constraint": null, "activation": "relu", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "Dense-3", "use_bias": true, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"kernel_regularizer": null, "trainable": true, "units": 4, "bias_constraint": null, "activation": "linear", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "name": "Out", "use_bias": true, "bias_regularizer": null}}], "keras_version": "2.2.2"}